[
	{
		"ID": 0,
		"Title": "Généralités",
		"Content": "Un Agrégateur permet de créer un tableau à partir d'éléments simples ou bien de tableaux déjà existants. Contrairement aux autres opérateurs, un agrégateur prend autant d’arguments en entrée que nécessaire.",
		"Image":"",
		"Video":""
	},	
	{
		"ID": 1,
		"Title": "BoolTab_Agg_BoolStar",
		"Content": "Retour : bool[]\nSymbole : B[]aggB*\nArgument 1 : bool*\nDescription : Agrégateur de booléens. Il prend n arguments en entrée et les agrège en un tableau qu'il retourne en sortie. Les arguments peuvent être des bool ou des bool[].",
		"Image":"",
		"Video":""
	},	
	{
		"ID": 2,
		"Title": "ColorTab_Agg_ColorStar",
		"Content": "Retour : color[]\nSymbole : C[]aggC*\nArgument 1 : color*\nDescription : Agrégateur de couleurs. Il prend n arguments en entrée et les agrège en un tableau qu'il retourne en sortie. Les arguments peuvent être des color ou des color[].",
		"Image":"",
		"Video":""
	},	
	{
		"ID": 3,
		"Title": "RefTab_Agg_RefStar",
		"Content": "Retour : ref[]\nSymbole : R[]aggR*\nArgument 1 : ref*\nDescription : Agrégateur de références. Il prend n arguments en entrée et les agrège en un tableau qu'il retourne en sortie. Les arguments peuvent être des ref ou des ref[].",
		"Image":"",
		"Video":""
	},	
	{
		"ID": 4,
		"Title": "ScalTab_Agg_ScalStar",
		"Content": "Retour : scal[]\nSymbole : S[]aggS*\nArgument 1 : scal*\nDescription : Agrégateur de scalaires. Il prend n arguments en entrée et les agrège en un tableau qu'il retourne en sortie. Les arguments peuvent être des scal ou des scal[].",
		"Image":"",
		"Video":""
	},	
	{
		"ID": 5,
		"Title": "TxtTab_Agg_TxtStar",
		"Content": "Retour : txt[]\nSymbole : T[]aggT*\nArgument 1 : txt*\nDescription : Agrégateur de textes. Il prend n arguments en entrée et les agrège en un tableau qu'il retourne en sortie. Les arguments peuvent être des txt ou des txt[].",
		"Image":"",
		"Video":""
	},	
	{
		"ID": 6,
		"Title": "VecTab_Agg_VecStar",
		"Content": "Retour : vec[]\nSymbole : V[]aggV*\nArgument 1 : vec*\nDescription : Agrégateur de vecteurs. Il prend n arguments en entrée et les agrège en un tableau qu'il retourne en sortie. Les arguments peuvent être des vec ou des vec[].",
		"Image":"",
		"Video":""
	},	
]