[
	{
		"ID": 0,
		"Title": "Introduction",
		"Content": [{
				"SubTitle": "",
				"Content": "Le Grand Flot est un monde aussi étrange que vaste, regorgeant de mystères. Comment les Lumys sont-ils apparus? D'où viennent ces ruines ? Quelle est la nature des cristaux qui jonchent les fonds marins? Vous trouverez dans ces Archives des éléments de réponses à ces questions."
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 1,
		"Title": "Les Anciens",
		"Content": [{
				"SubTitle": "",
				"Content": "Longtemps avant que les Lumys n'apparaissent, le monde était peuplé par des créatures incommensurablement puissantes et sages. À la fois savants, bâtisseurs et conquérant, les Anciens firent du monde leur terrain de jeu. Les tours de leurs cités s'élançaient jusqu'aux cieux, leurs armées semblaient invincibles et leur règne sembalait découler de la volonté divine. En quelques siècles, les autres peuples se soumirent, de leur propre gré ou par la force. etL'empire des Anciens s'étendait sur toute la surface du globe. Mais un jour, leur civilisation millénaire fut balayée en quelques instants. Il n'en reste désormais qu'une collection de ruines tapies au fond des flots, silencieuses et oubliées. Comment et pourquoi le règne incontesté des Anciens s'est-il achevé si brutalement, nul ne le sait. Auraient-ils été avalés par les eaux? "
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 2,
		"Title": "L'Ether",
		"Content": [{
				"SubTitle": "",
				"Content": "La puissance légendaire des Anciens était attribuée à leur maîtrise de l'Ether, une source d'énergie lumineuse au potentiel infini. Entre leurs mains, cette lumière prenait une myriade de forme, tour à tour structure majestueuse, portail vers les recoins isolés du monde, chaleur revigorant les malades, ou implacable sentence délivrée aux inconscients osant lever le poing. C'est par l'Ether que les Anciens façonnèrent le monde à leur image. Mais cette source d'énergie est si puissante et imprévisibe qu'en perdre le contrôle peut s'avérer fatal. Et si la clé de voute de la puissance des Anciens avaient causé leur perte? Aujourd'hui, les flots semblent crépiter d'Ether, on en retrouve dans toutes les formes de vie du Grand Flot et au coeur même des roches qui tapissent le fond."
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 3,
		"Title": "Le Cataclysme",
		"Content": [{
				"SubTitle": "",
				"Content": ""
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 4,
		"Title": "Le Premier",
		"Content": [{
				"SubTitle": "",
				"Content": ""
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 5,
		"Title": "Les Prysmes, les Lumys",
		"Content": [{
				"SubTitle": "",
				"Content": ""
			}
		],
		"Image":"",
		"Video":""
	}
	
	
]