[
	{
		"ID": 0,
		"Title": "Introduction",
		"Content": [{
				"SubTitle": "",
				"Content": "Le Grand Flot est un monde aussi étrange que vaste, regorgeant de mystères. Comment les Lumys sont-ils apparus ? D'où proviennent ces ruines ? Quelle est la nature des cristaux qui jonchent les fonds marins ? Vous trouverez dans ces Archives des éléments de réponse à ces questions."
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 1,
		"Title": "Les Anciens",
		"Content": [{
				"SubTitle": "",
				"Content": "Bien avant que les Lumys n'apparaissent, le monde était peuplé par des créatures incommensurablement sages et puissantes. À la fois savants, bâtisseurs et conquérants, les Anciens firent du monde leur terrain de jeu. Les tours de leurs cités s'élançaient jusqu'aux cieux, leurs armées semblaient invincibles, et leur règne paraissait découler de la volonté divine. En l'espace de quelques siècles, les autres peuples se soumirent, de leur propre gré ou par la force, et l'empire des Anciens s'étendit sur toute la surface du globe. Mais un jour, leur civilisation millénaire fut balayée en quelques instants. Il n'en reste désormais qu'une flopée de ruines tapies au fond des flots, silencieuses et oubliées. Comment et pourquoi le règne incontesté des Anciens s'est-il achevé si brutalement, nul ne le sait. Auraient-ils été avalés par les eaux ?"
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 2,
		"Title": "L'Éther",
		"Content": [{
				"SubTitle": "",
				"Content": "La puissance légendaire des Anciens est attribuée à leur maîtrise de l'Éther, une source d'énergie lumineuse au potentiel sans limites. Entre leurs mains, cette lumière prenait une myriade de formes, tour à tour structure majestueuse, portail vers les recoins isolés du monde, chaleur revigorant les malades, ou implacable sentence délivrée aux inconscients osant se rebeller. C'est par l'Éther que les Anciens façonnèrent le monde à leur image. Mais cette source d'énergie est si puissante et imprévisible qu'en perdre le contrôle peut s'avérer fatal. Et si la clé de voûte de la puissance des Anciens avait causé leur perte ? Aujourd'hui, les eaux semblent crépiter d'Éther ; on en retrouve dans toutes les formes de vie du Grand Flot, et au cœur même des roches qui en tapissent le fond."
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 3,
		"Title": "Le Premier",
		"Content": [{
				"SubTitle": "",
				"Content": "Chaque Lumy est imprégné du souvenir imprécis d'un temps lointain, quand la différence et le conflit n'existaient pas. Un souvenir d'une conscience en éveil, omnisciente et omnipotente. Cette conscience, ils l'appellent le Premier. Un être de légende qui aurait erré au sein du Grand Flot pendant des millénaires, avant d'éclater en une ribambelle de fragments. Ces fragments, les Prysmes, donnèrent naissance aux Lumys. Parmi les Nuées, les raisons de l'éclatement du Premier sont une source intarissable de conflit. En effet, chaque Nuée garde en mémoire différentes émotions qu'aurait ressenties le Premier au moment de sa mort. Pour certaines, le Premier s'est sacrifié afin de de donner vie aux Lumys en prenant conscience que de la différence émergerait un monde nouveau. Pour d'autres, la mort du Premier est une tragédie causée par des courants divergents au sein de sa conscience ; elles cherchent donc à réunifier les Lumys par tous les moyens, et n'hésitent pas à oblitérer les réfractaires."
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 4,
		"Title": "Les Nuées",
		"Content": [{
				"SubTitle": "",
				"Content": "Une Nuée de Lumys fonctionne comme une seule et même entité. Au cœur de la Nuée se trouve le Prysme, son centre névralgique. Alimenté en roches gorgées d'Éther, il génère des Lumys qui, en fonction de la caste à laquelle ils appartiennent, remplissent un rôle spécifique au sein de la Nuée. Les Lumys sont les organes de la Nuée, le Prysme son cerveau. Personne ne sait comment les Prysmes, qui semblent incapables de se déplacer, apparaîssent dans différentes régions du Grand Flot. Peut-être est-ce lié à l'absorption d'Éther au travers des cristaux que leur apportent les Lumys ?"
			}
		],
		"Image":"",
		"Video":""
	}
	
	
]