[
	{
		"ID": 0,
		"Title": "Introduction",
		"Content": [{
				"SubTitle": "",
				"Content": "<color=#b2ff7cff>Le Grand Flot</color> est un monde aussi étrange que vaste, regorgeant de mystères. \n\nComment les Lumys sont-ils apparus ? D'où viennent ces ruines ? Quelle est la nature des cristaux qui jonchent les fonds marins? \n\nVous trouverez dans ces <color=#b2ff7cff>Archives</color> des éléments de réponses à ces questions."
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 1,
		"Title": "Les Anciens",
		"Content": [{
				"SubTitle": "",
				"Content": "Longtemps avant que les Lumys n'apparaissent, le monde était peuplé par des créatures incommensurablement puissantes et sages. \nÀ la fois savants, bâtisseurs et conquérant, les <color=#b2ff7cff>Anciens</color> firent du monde leur terrain de jeu. Les tours de leurs cités s'élançaient jusqu'aux cieux, leurs armées semblaient invincibles et leur règne sembalait découler de la volonté divine. \nEn quelques siècles, les autres peuples se soumirent, de leur <color=#b2ff7cff>propre gré</color> ou par la <color=#ff5656ff>force</color>. Et l'empire des Anciens s'étendait sur toute la surface du globe. \n\nMais un jour, leur civilisation millénaire <color=#ff5656ff>fut balayée</color> en quelques instants. Il n'en reste désormais qu'une collection de ruines tapies au fond des flots, silencieuses et oubliées. Comment et pourquoi le règne incontesté des <color=#b2ff7cff>Anciens</color> s'est-il achevé si brutalement, nul ne le sait. Auraient-ils été avalés par les eaux ? "
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 2,
		"Title": "L'Ether",
		"Content": [{
				"SubTitle": "",
				"Content": "La puissance légendaire des Anciens est attribuée à leur maîtrise de l'<color=#b2ff7cff>Ether</color>, <color=#3efff6ff>une source d'énergie lumineuse au potentiel sans limite.</color> Entre leurs mains, cette lumière prenait une myriade de forme, tour à tour structure majestueuse, portail vers les recoins isolés du monde, chaleur revigorant les malades, ou implacable sentence délivrée aux inconscients osant lever le poing. \nC'est par l'<color=#b2ff7cff>Ether</color> que les <color=#b2ff7cff>Anciens</color> façonnèrent le monde à leur image. \nMais cette source d'énergie est si puissante et imprévisibe qu'en perdre le contrôle peut s'avérer fatal. Et si la clé de voute de la puissance des <color=#b2ff7cff>Anciens</color> avaient causé leur perte? Aujourd'hui, les flots semblent crépiter d'<color=#b2ff7cff>Ether</color>, on en retrouve dans toutes les formes de vie du Grand Flot et au coeur même des roches qui tapissent le fond."
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 3,
		"Title": "Le Premier",
		"Content": [{
				"SubTitle": "",
				"Content": "Chaque Lumy est imprégné d'un souvenir imprécis d'un temps lointain, quand la différence et le conflit n'existaient pas. Un souvenir d'une conscience en éveil, omnisciente et omnipotente. Cette conscience, ils l'appellent <color=#b2ff7cff>Les Premiers</color>. \nUn être de légende auqui aurait erré au sein du Grand Flot pendant des millénaires, <color=#3efff6ff>avant d'éclater en une myriade de fragments.</color> Ces fragments, les <color=#b2ff7cff>Prysmes</color>, donnèrent naissance aux Lumys. Parmi les Nuées, les raisons de l'éclatement du Premier sont une <color=#ff5656ff>source inépuisable de conflits.</color> En effet, chaque Nuée garde en mémoire différentes émotions qu'aurait ressenties <color=#b2ff7cff>le Premier</color> au moment de sa mort. Pour certaines, <color=#b2ff7cff>le Premier</color> s'est sacrifié afin de de donner vie aux Lumys en prenant conscience que de la différence émergerait un monde nouveau. \nPour les autres, la mort du <color=#b2ff7cff>Premier</color> est une tragédie causée par des courants divergents au sein de sa conscience : elles cherchent à réunifier les Lumys par tous les moyens et n'hésitent pas à oblitérer les réfractaires."
			}
		],
		"Image":"",
		"Video":""
	},
	{
		"ID": 4,
		"Title": "Les Nuées",
		"Content": [{
				"SubTitle": "",
				"Content": "Une Nuée de Lumy fonctionne comme une seule et même entité. Au coeur de la Nuée se trouve le <color=#b2ff7cff>Prysme</color>, son centre névralgique. Alimenté en roches gorgées d'Ether, <color=#3efff6ff>il génère des Lumys qui, en fonction de la caste à laquelle ils appartiennent, remplissent un rôle différent au sein de la Nuée.</color> \nLes Lumys sont les organes de la Nuée, le <color=#b2ff7cff>Prysme</color> son cerveau. Personne ne sait comment les <color=#b2ff7cff>Prysmes</color>, qui semblent incapables de se déplacer, apparaîssent dans différentes régions du <color=#b2ff7cff>Grand Flot</color>. \n\nPeut être est-ce lié à l'absorption d'<color=#b2ff7cff>Ether</color> au travers des cristaux que leur apportent les Lumys? "
			}
		],
		"Image":"",
		"Video":""
	}
	
	
]