[{
		"ID": 0,
		"Title": "Généralités",
		"Content": [{
				"SubTitle": "",
				"Content": "L'éditeur de modèle comportemental est l'écran dans lequel vous créez des Modèles comportementaux, ces arbres décisionnels qui vont déterminer le comportement de vos Lumy en fonction du rôle que vous souhaitez qu'ils adoptent durant l'affrontement. Pour ce faire, vous avez à votre disposition une variété d'éléments de logique algorithmique appelés nodes. Il y en a cinq types différents: les Etats, les Actions, les Opérateurs, les Paramètres et les Composites. C'est en reliant ces nodes par des Transitions que vous créez un modèle comportemental."
			}
		],
		"Image": "",
		"Video": ""
	},
	{
		"ID": 1,
		"Title": "Actions",
		"Content": [{
				"SubTitle": "goto",
				"Content": "L’unité se déplace suivant le tableau de vecteurs donné en argument. Si le tableau de vecteurs ne contient qu'un seul element, l'agent se déplace en evitant les obstacles."
			},
			{
				"SubTitle": "strike",
				"Content": "L’unité utilise son attaque de base sur la cible donnée en argument."
			},
			{
				"SubTitle": "pick",
				"Content": "L’unité rammasse la ressource donnée en argument."
			},
			{
				"SubTitle": "drop",
				"Content": "L’unité lâche la ressource qu’elle transporte. Si le drop est effectué à proximité du prysme alors la ressource est collectée."
			},
			{
				"SubTitle": "lay",
				"Content": "Le prysme génère une unité de la caste désignée par le nom <cast> donné."
			},
			{
				"SubTitle": "trace",
				"Content": "L'unité indique des positions afin de tracer un chemin permettant de passer par tous les vecteurs passés en argument. La trace ainsi créée a une durée de vie de 12 secondes, et les différents points créés sont espacés de 1."
			},
			{
				"SubTitle": "random roaming",
				"Content": "L’unité se déplace en premnantun point a la distance donné en deuxième argument sur le conne d'angle passé en premiere argument."
			}
		],
		"Image": "",
		"Video": ""
	},
	{
		"ID": 2,
		"Title": "Etats Intermediaires",
		"Content": [{
				"SubTitle": "",
				"Content": "Utilisé pour rendre un modèle comportemental compréhensible, les états intermédiaires n’influent directement sur l'arbre décisionnel mais ils permettent de lo'rganiser. Ce sont des embranchements qui structurent le MC, depuis l'INIT jusqu'aux noeuds d'actions en bout de branches."
			}
		],
		"Image": "",
		"Video": ""
	},
	{
		"ID": 3,
		"Title": "Transitions",
		"Content": [{
				"SubTitle": "",
				"Content": "Elément servant à relier les diférent nodes entre eux. la création d'une transition est conditionnée par le type de renvoi et d'entrée des nodes qu'elle relie. Une transition peut uniquement relier :\nDeux états\nUn état et un composite\nUn état et un opérateur\nUn état et un paramètre\nDeux opérateurs\nUn opérateur et un composite\nUn opérateur et un paramètre\nDeux composites\nun Composite et un paramètre"
			}
		],
		"Image": "",
		"Video": ""
	},
	{
		"ID": 4,
		"Title": "Operateurs",
		"Content": [{
				"SubTitle": "",
				"Content": "Les opérateurs sont des fonctions algorithmiques renvoyant un paramètre et prenant jusqu'a trois paramètresen entrée. Ces opérateur servent a constituer les arbres syntaxiques. Il existe dix grands types d'opérateurs :\nLogique\nDéfinition\nMathématique\nComparateur\nAccesseur\nExtracteur\nAgregateur\nFiltre\nTableau\nInverseur"
			}
		],
		"Image": "",
		"Video": ""
	},
	{
		"ID": 5,
		"Title": "Paramètres",
		"Content": [{
				"SubTitle": "Description",
				"Content": "Lorsque le Modèle Comportemental du Lumy de vérifie les conditions pour exécuter une action, ou qu'il est en train effectuer une action, il lui faut extraire des informations précises du contexte de la partie en cours. Ce sont les paramètres des arbres syntaxiques. Il en existe six catégories. A chaque catégorie de paramètres est attachée une couleur qui apparaît sur la transition entre ce paramètre et la node qui lui est reliée. Ce code couleur facilite grandement la lecture des Modèles Comportementaux."
			},
			{
				"SubTitle": "Booléen",
				"Content": "C’est un élément binaire pouvant prendre comme valeur VRAI ou FAUX. La couleur des transitions pour les booléens est le bleu."
			},
			{
				"SubTitle": "Couleur",
				"Content": "Un paramètre propre au jeu possédant six valeurs : ROUGE, VERT, BLEU, CYAN, MAGENTA, JAUNE. La couleur des transitions pour les Couleurs est le chocolat."
			},
			{
				"SubTitle": "Scalaire",
				"Content": "Un nombre entier ou à virgule. La couleur des transitions pour les scalaires est le sépia."
			},
			{
				"SubTitle": "Vecteur",
				"Content": "Un couple de Scalaire, utiliser pour repérer une position sur la carte. La couleur des transitions pour les vecteurs est le violet."
			},
			{
				"SubTitle": "Texte",
				"Content": "Une chaîne de caractère. La couleur des transitions pour les textes est le turquoise."
			},
			{
				"SubTitle": "Référence",
				"Content": "Une référence est un paramètre regroupant des attributs, qui peuvent être utilisé séparément comme paramètre. La couleur des transitions pour les références est le rouge."
			},
			{
				"SubTitle": "Tableau",
				"Content": "Tout paramètre autre que le Texte peut exister sous la forme de tableau de ce paramètre. Les transitions vers les tableaux sont de la couleur qui correspond au contenu du tableau."
			}
		],
		"Image": "",
		"Video": ""
	},
	{
		"ID": 6,
		"Title": "Références",
		"Content": [{
				"SubTitle": "Description",
				"Content": "Une référence est un paramètre regroupant des attributs, qui peuvent être utilisé séparément comme paramètre. Les références sont instanciées au cours de la partie, les valeurs des attributs d'une même référence peuvent donc varier d'une partie à l'autre, ou même au cours d'une partie."
			},
			{
				"SubTitle": "Game",
				"Content": "Relatif à la partie en cours, Game donne des informations générales\ntime (scalaire) : temps écoulé depuis le début de la partie\ntotalTime(scalaire) : durée maximale d’une partie\nmaxPop (scalaire) : population Maximale\nseamSize (scalaire) : taille des gisements\ncaveMultiplier (scalaire) : coefficient multiplicateur de la quantité de ressources aux départ."
			},
			{
				"SubTitle": "Home",
				"Content": "Renvoie à la base du Lumy qui exécute le MC\npos (vecteur) : position du Prysme\nrRes (scalaire) : quantité de ressources rouges possédées\ngRes\n(scalaire) : quantité de ressources vertes possédées\nvRes (scalaire) : quantité de ressources bleues possédées\npopulation (reference) :\npopulation de la nuée en fonction des castes selon le modèle suivant\ncasteName1 (scalaire) : nombre de Lumys de la caste casteName1\n…\ncasteNameN(scalaire) : nombre de Lumys de la caste casteNameN\ncost (reference) : Coût des différentes castes selon le modèle suivant\ncasteName1 (reference) : Lumy de la caste casteName1\nRed (scalaire) : coût en ressources rouges\nGreen (scalaire) : coût en ressources vertes\nBlue (scalaire) : coût en ressources bleues\n...\ncasteNameN (reference) : Lumy de la caste casteNameN\nRed (scalaire) : coût en ressources rouges\nGreen (scalaire) : coût en ressources vertes\nBlue (scalaire) : coût en ressources bleues."
			},
			{
				"SubTitle": "Self",
				"Content": "L’ensemble des informations propre au Lumy exécutant le MC\ncast (text) : nom de la caste du Lumy\ncurPos (vecteur) : position du Lumy\ntrgPos (vecteur) : destination du Lumy\nvitalityMax (scalaire) : Vitalité max du Lumy\nvitality (scalaire) : Vitalité actuelle du Lumy\nstrength (scalaire) : Force du Lumy\nstamina (scalaire) : Endurance du Lumy\nactSpd (scalaire) : Vitesse d’action du Lumy\nmoveSpd (scalaire) : Vitesse de déplacement du Lumy\nnbItemMax (scalaire) : Quantité maximale de ressources transportées\nnbItem (scalaire) : Quantité de ressources transportées\natkRange (scalaire) : Portée d’attaque du Lumy\npickRange (scalaire) : Portée de saisie du Lumy\nprodCost ( ? ) : \nlayTimeCost (scalaire) : Temps de production du Lumy\nvisionRange (scalaire) : Portée visuelle du Lumy."
			},
			{
				"SubTitle": "Allies[]",
				"Content": "Ce tableau contient les références Self des Lumy Alliés présent dans le champ de vision du Lumy exécutant le MC\nlumy1 (Référence : Self) : le Self de lumy1\n…\nlumyN (Référence : Self) : le Self de lumyN."
			},
			{
				"SubTitle": "Enemies[]",
				"Content": "Un autre tableau qui prend les références Self des Lumy Ennemis dans le champ de vision. Il contient les mêmes informations qu'Allies[], mais pour les Lumys de l'adversaire."
			},
			{
				"SubTitle": "Ressources[]",
				"Content": "Un tableau de références qui regroupe les ressources dans le champs de vision du Lumy exécutant le MC.\nRessource (Référence) :\nstock (scalaire) : quantité de ressources restantes\npos (vecteur) : position de la ressource\ncolor (couleur) : couleur de la ressource."
			},
			{
				"SubTitle": "Trace[]",
				"Content": "Un tableau de références qui regroupe les traces dans le champ de vision du Lumy exécutant le MC.\nTrace (Référence) :\npoints (vecteur[]) : Liste des points définissant la trace\ncolor (couleur) : Couleur de la trace\nage (scalaire) :  âge de la trace, le temps écoulé depuis sa création."
			}
		],
		"Image": "",
		"Video": ""
	},
	{
		"ID": 7,
		"Title": "Composite",
		"Content": [{
				"SubTitle": "",
				"Content": "Composant hétéroclite, un composite est un rassemblement de paramètres et d’opérateurs prédéfinis. Ils permettent de simplifier le Modèle Comportemental d’un Lumy. Les Composites sont des fonctions complexe ne nécessitant pas forcément de paramètres en entrée mais renvoyant un paramètre en sortie. Ils sont utilisés pour améliorer la lisibilité dans l'éditeur de Modèle Comportemental. Il existe un total de x composites, ils sont triés dans l'éditeur en fonction du type de référence qu'ils interrogent."
			}
		],
		"Image": "",
		"Video": ""
	}

]