[
	{
		"ID": 0,
		"Title": "Généralités",
		"Content": "Lorsque le Modèle Comportemental du Lumy de vérifie les conditions pour exécuter une action, ou qu'il est en train effectuer une action, il lui faut extraire des informations précises du contexte de la partie en cours. Ce sont les paramètres des arbres syntaxiques. Il en existe six catégories. A chaque catégorie de paramètres est attachée une couleur qui apparaît sur la transition entre ce paramètre et la node qui lui est reliée. Ce code couleur facilite grandement la lecture des Modèles Comportementaux.",
		"Image":"",
		"Video":""
	},
	{
		"ID": 1,
		"Title": "Booléen",
		"Content": "C’est un élément binaire pouvant prendre comme valeur VRAI ou FAUX. La couleur des transitions pour les booléens est le bleu.",
		"Image":"",
		"Video":""
	},
	{
		"ID": 2,
		"Title": "Couleur",
		"Content": "Un paramètre propre au jeu possédant six valeurs : ROUGE, VERT, BLEU, CYAN, MAGENTA, JAUNE. La couleur des transitions pour les Couleurs est le chocolat.",
		"Image":"",
		"Video":""
	},
	{
		"ID": 3,
		"Title": "Scalaire",
		"Content": "Un nombre entier ou à virgule. La couleur des transitions pour les scalaires est le sépia.",
		"Image":"",
		"Video":""
	},
	{
		"ID": 4,
		"Title": "Vecteur",
		"Content": "Un couple de Scalaire, utiliser pour repérer une position sur la carte. La couleur des transitions pour les vecteurs est le violet.",
		"Image":"",
		"Video":""
	},
	{
		"ID": 5,
		"Title": "Texte",
		"Content": "Une chaîne de caractère. La couleur des transitions pour les textes est le turquoise.",
		"Image":"",
		"Video":""
	},
	{
		"ID": 6,
		"Title": "Référence",
		"Content": "Une référence est un paramètre regroupant des attributs, qui peuvent être utilisé séparément comme paramètre. La couleur des transitions pour les références est le rouge.",
		"Image":"",
		"Video":""
	},
	{
		"ID": 7,
		"Title": "Tableau",
		"Content": "Tout paramètre autre que le Texte peut exister sous la forme de tableau de ce paramètre. Les transitions vers les tableaux sont de la couleur qui correspond au contenu du tableau.",
		"Image":"",
		"Video":""
	},
	
	
	
]